docker-code/www/codeigniter4/app/Controllers/Admin/Client.php

SELECT *
FROM `clients`
---
    public function listClients(){
        $ClientModel = new ClientModel();
        $data= [
            'arrayClients' => $ClientModel->findall()
        ];